Revit 2027 API
ParameterTypeId.DimTotalLength Property
 "Total Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DimTotalLength { get; }
Public Shared ReadOnly Property DimTotalLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DimTotalLength {
	ForgeTypeId^ get ();
}
static member DimTotalLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace